devdnl/dnx-rtos/src/system/drivers/i2c/stm32fx/i2c_lld.c
/*=========================================================================*//**
@file    i2c_lld.c

@author  Daniel Zorychta

@brief   This driver support I2C peripherals.

@note    Copyright (C) 2020  Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

// NOTE: 10-bit addressing mode is experimental and not tested!

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32fx/i2c_cfg.h"
#include "gpio_ddi.h"
#include "i2c_ioctl.h"
#include "i2c.h"
#include "i2c_regs.h"

#if defined(ARCH_stm32f1)
#include "lib/stm32f10x_rcc.h"
#include "stm32f1/dma_ddi.h"
#elif defined(ARCH_stm32f4)
#include "lib/stm32f4xx_rcc.h"
#include "stm32f4/dma_ddi.h"
#endif

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define USE_DMA (((_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0) || (_I2C3_USE_DMA > 0)) && __ENABLE_DMA__)

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/// type defines configuration of single I2C peripheral
typedef struct {
  #if USE_DMA > 0
        const bool              use_DMA;              //!< peripheral uses DMA and IRQ (true), or only IRQ (false)
        const u8_t              DMA_channel;          //!< DMA peripheral request channel number
        const u8_t              DMA_tx_stream_pri;    //!< primary Tx stream number
        const u8_t              DMA_rx_stream_pri;    //!< primary Rx stream number
        const u8_t              DMA_tx_stream_alt;    //!< alternative Tx stream number
        const u8_t              DMA_rx_stream_alt;    //!< alternative Rx stream number
  #endif
        const I2C_periph_t     *const I2C;            //!< pointer to the I2C peripheral
        const u32_t             freq;                 //!< peripheral SCL frequency [Hz]
        const u32_t             APB1ENR_clk_mask;     //!< mask used to enable I2C clock in the APB1ENR register
        const IRQn_Type         IRQ_EV_n;             //!< number of event IRQ vector
        const IRQn_Type         IRQ_ER_n;             //!< number of error IRQ vector
        const bool              duty_cycle_16_9;      //!< duty cycle
} I2C_info_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static inline I2C_periph_t *get_I2C(I2C_dev_t *hdl);
static void clear_address_event(I2C_dev_t *hdl);
static void IRQ_EV_handler(u8_t major);
static void IRQ_ER_handler(u8_t major);

#if USE_DMA > 0
#if defined(ARCH_stm32f1)
static bool DMA_callback(DMA_Channel_t *channel, u8_t SR, void *arg);
#elif defined(ARCH_stm32f4)
static bool DMA_callback(DMA_Stream_TypeDef *stream, u8_t SR, void *arg);
#endif
static int  wait_for_event_DMA(I2C_dev_t *hdl);
#endif

/*==============================================================================
  Local object definitions
==============================================================================*/
// peripherals configuration
static const I2C_info_t I2C_HW[_I2C_NUMBER_OF_PERIPHERALS] = {
#if defined(ARCH_stm32f1)
        #if defined(RCC_APB1ENR_I2C1EN)
        {
                #if USE_DMA > 0
                .use_DMA           = _I2C1_USE_DMA,
                .DMA_tx_stream_pri = 6,
                .DMA_tx_stream_alt = UINT8_MAX,
                .DMA_rx_stream_pri = 7,
                .DMA_rx_stream_alt = UINT8_MAX,
                #endif
                .I2C               = (I2C_periph_t*)I2C1,
                .freq              = _I2C1_FREQUENCY,
                .APB1ENR_clk_mask  = RCC_APB1ENR_I2C1EN,
                .IRQ_EV_n          = I2C1_EV_IRQn,
                .IRQ_ER_n          = I2C1_ER_IRQn,
                .duty_cycle_16_9   = _I2C1_DUTY_CYCLE
        },
        #endif
        #if defined(RCC_APB1ENR_I2C2EN)
        {
                #if USE_DMA > 0
                .use_DMA           = _I2C2_USE_DMA,
                .DMA_tx_stream_pri = 4,
                .DMA_tx_stream_alt = UINT8_MAX,
                .DMA_rx_stream_pri = 5,
                .DMA_rx_stream_alt = UINT8_MAX,
                #endif
                .I2C               = (I2C_periph_t*)I2C2,
                .freq              = _I2C2_FREQUENCY,
                .APB1ENR_clk_mask  = RCC_APB1ENR_I2C2EN,
                .IRQ_EV_n          = I2C2_EV_IRQn,
                .IRQ_ER_n          = I2C2_ER_IRQn,
                .duty_cycle_16_9   = _I2C2_DUTY_CYCLE
        },
        #endif
#elif defined(ARCH_stm32f4)
        #if defined(RCC_APB1ENR_I2C1EN)
        {
                #if USE_DMA > 0
                .use_DMA           = _I2C1_USE_DMA,
                .DMA_tx_stream_pri = 6,
                .DMA_tx_stream_alt = 7,
                .DMA_rx_stream_pri = 0,
                .DMA_rx_stream_alt = 5,
                .DMA_channel       = 1,
                #endif
                .I2C               = (I2C_periph_t*)I2C1,
                .freq              = _I2C1_FREQUENCY,
                .APB1ENR_clk_mask  = RCC_APB1ENR_I2C1EN,
                .IRQ_EV_n          = I2C1_EV_IRQn,
                .IRQ_ER_n          = I2C1_ER_IRQn,
                .duty_cycle_16_9   = _I2C1_DUTY_CYCLE
        },
        #endif
        #if defined(RCC_APB1ENR_I2C2EN)
        {
                #if USE_DMA > 0
                .use_DMA           = _I2C2_USE_DMA,
                .DMA_tx_stream_pri = 7,
                .DMA_tx_stream_alt = 7,
                .DMA_rx_stream_pri = 2,
                .DMA_rx_stream_alt = 3,
                .DMA_channel       = 7,
                #endif
                .I2C               = (I2C_periph_t*)I2C2,
                .freq              = _I2C2_FREQUENCY,
                .APB1ENR_clk_mask  = RCC_APB1ENR_I2C2EN,
                .IRQ_EV_n          = I2C2_EV_IRQn,
                .IRQ_ER_n          = I2C2_ER_IRQn,
                .duty_cycle_16_9   = _I2C2_DUTY_CYCLE
        },
        #endif
        #if defined(RCC_APB1ENR_I2C3EN)
        {
                #if USE_DMA > 0
                .use_DMA           = _I2C3_USE_DMA,
                .DMA_tx_stream_pri = 4,
                .DMA_tx_stream_alt = 4,
                .DMA_rx_stream_pri = 2,
                .DMA_rx_stream_alt = 2,
                .DMA_channel       = 3,
                #endif
                .I2C               = (I2C_periph_t*)I2C3,
                .freq              = _I2C3_FREQUENCY,
                .APB1ENR_clk_mask  = RCC_APB1ENR_I2C3EN,
                .IRQ_EV_n          = I2C3_EV_IRQn,
                .IRQ_ER_n          = I2C3_ER_IRQn,
                .duty_cycle_16_9   = _I2C3_DUTY_CYCLE
        },
        #endif
#endif
};

/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/
//==============================================================================
/**
 * @brief  Returns I2C address of current device
 * @param  hdl          device handle
 * @return I2C peripheral address
 */
//==============================================================================
static inline I2C_periph_t *get_I2C(I2C_dev_t *hdl)
{
        return const_cast(I2C_periph_t*, I2C_HW[hdl->major].I2C);
}

//==============================================================================
/**
 * @brief  Function handle error (try make the interface working)
 * @param  hdl          device handle
 */
//==============================================================================
static void reset(I2C_dev_t *hdl, bool reinit)
{
        printk("I2C%d:%d interface reset", hdl->major, hdl->minor);

        I2C_periph_t *i2c = get_I2C(hdl);

        CLEAR_BIT(i2c->CR2, PI2C_CR2_ITEVTEN | PI2C_CR2_ITERREN | PI2C_CR2_ITBUFEN);

        sys_critical_section_begin();
        {
                volatile u8_t tmp = i2c->SR1;
                              tmp = i2c->SR2;
                              tmp = i2c->DR;
                              tmp = i2c->DR;

                UNUSED_ARG1(tmp);

                i2c->SR1 = 0;

                CLEAR_BIT(i2c->CR1, PI2C_CR1_PE);
        }
        sys_critical_section_end();

        sys_sleep_ms(1);

        if (reinit) {
                u16_t OAR1 = i2c->OAR1;
                _I2C_LLD__init(hdl->major);
                i2c->OAR1 = OAR1;
        }

        _I2C_LLD__stop(hdl);


        I2C_recovery_t *recovery = &_I2C[hdl->major]->recovery;

        if (recovery->enable) {
                i8_t state = _GPIO_DDI_get_pin(recovery->SDA.port_idx,
                                               recovery->SDA.pin_idx);
                int SCL_mode = 0;
                int err = _GPIO_DDI_get_pin_mode(recovery->SCL.port_idx,
                                                 recovery->SCL.pin_idx,
                                                 &SCL_mode);

                if (err) {
                        printk("I2C%d:%d invalid SCL pin - recovery skipped",
                               hdl->major, hdl->minor);
                }

                if ((state == 0) && (err == 0)) {
                        printk("I2C%d:%d detected SDA low - bus recovery",
                               hdl->major, hdl->minor);

                        #if defined(ARCH_stm32f1)
                        int mode = GPIO_MODE__OD_10MHz;
                        #elif defined(ARCH_stm32f4)
                        int mode = GPIO_MODE__OD;
                        #endif
                        _GPIO_DDI_set_pin_mode(recovery->SCL.port_idx,
                                               recovery->SCL.pin_idx,
                                               mode);

                        for (int i = 0; i < 10; i++) {
                                _GPIO_DDI_clear_pin(recovery->SCL.port_idx,
                                                    recovery->SCL.pin_idx);
                                sys_sleep_ms(1);

                                _GPIO_DDI_set_pin(recovery->SCL.port_idx,
                                                  recovery->SCL.pin_idx);
                                sys_sleep_ms(1);
                        }

