devdnl/dnx-rtos/src/system/drivers/i2c/stm32fx/i2c_lld.c
                        _GPIO_DDI_set_pin_mode(recovery->SCL.port_idx,
                                               recovery->SCL.pin_idx,
                                               SCL_mode);

                        state = _GPIO_DDI_get_pin(recovery->SDA.port_idx,
                                                  recovery->SDA.pin_idx);

                        printk("I2C%d:%d recovery %s", hdl->major, hdl->minor,
                               (state == 1) ? "success" : "fail");
                }
        }
}

//==============================================================================
/**
 * @brief  Function wait for DMA event (IRQ)
 * @param  hdl                  device handle
 * @param  DMA                  DMA channel
 * @return One of errno value (errno.h)
 */
//==============================================================================
#if USE_DMA > 0
static int wait_for_event_DMA(I2C_dev_t *hdl)
{
        I2C_periph_t *i2c = get_I2C(hdl);
        SET_BIT(i2c->CR2, PI2C_CR2_LAST | PI2C_CR2_DMAEN);

        int ferr = EIO;
        int err  = sys_queue_receive(_I2C[hdl->major]->event, &ferr, _I2C_DEVICE_TIMEOUT);

        CLEAR_BIT(i2c->CR2, PI2C_CR2_LAST | PI2C_CR2_DMAEN);

        if (!err) {
                err = ferr;
        }

        if (err) {
                reset(hdl, true);
        }

        return err;
}
#endif

//==============================================================================
/**
 * @brief  Function wait for I2C event (by using polling).
 * @param  hdl                  device handle
 * @param  SR1_event_mask       event mask (bits from SR1 register)
 * @param  timeout_ms           timeout in milliseconds
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int wait_for_event_poll(I2C_dev_t *hdl, u32_t flags, u32_t timeout_ms)
{
        u32_t BTT = 1000 / (I2C_HW[hdl->major].freq / 10); // 1000/f = T in ms
        u32_t CST = 1000 / __OS_TASK_SCHED_FREQ__;         // 1000/f = T in ms

        I2C_periph_t *i2c = get_I2C(hdl);
        u32_t tref = sys_time_get_reference();

        while (!(i2c->SR1 & flags)) {

                if (sys_time_is_expired(tref, timeout_ms)) {
                        printk("I2C%d:%d event poll timeout (SR1 mask: %Xh)",
                               hdl->major, hdl->minor, flags);
                        reset(hdl, true);
                        return EIO;
                }

                if (i2c->SR1 & (PI2C_SR1_ARLO | PI2C_SR1_BERR | PI2C_SR1_AF)) {
                        printk("I2C%d:%d event poll error", hdl->major, hdl->minor);
                        reset(hdl, true);
                        return EIO;
                }

                if (BTT >= CST) {
                        sys_thread_yield();
                }
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Clear event of send address
 * @param  hdl                  device handle
 */
//==============================================================================
static void clear_address_event(I2C_dev_t *hdl)
{
        I2C_periph_t *i2c = get_I2C(hdl);

        sys_critical_section_begin();
        {
                u16_t tmp;
                tmp = i2c->SR1;
                tmp = i2c->SR2;
                (void)tmp;
        }
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief  Enables selected I2C peripheral according with configuration
 * @param  major        peripheral number
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__init(u8_t major)
{
        const I2C_info_t *cfg = &I2C_HW[major];
        I2C_periph_t            *i2c = const_cast(I2C_periph_t*, I2C_HW[major].I2C);

        CLEAR_BIT(RCC->APB1ENR, cfg->APB1ENR_clk_mask);
        SET_BIT(RCC->APB1ENR, cfg->APB1ENR_clk_mask);

        SET_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        sys_sleep_ms(10);
        CLEAR_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);

        RCC_ClocksTypeDef clocks;
        memset(&clocks, 0, sizeof(RCC_ClocksTypeDef));
        RCC_GetClocksFreq(&clocks);

        if (clocks.PCLK1_Frequency < 2000000) {
                printk("I2C: PCLK1 below recommended 2MHz");
                return EIO;
        }

        NVIC_EnableIRQ(cfg->IRQ_EV_n);
        NVIC_EnableIRQ(cfg->IRQ_ER_n);
        NVIC_SetPriority(cfg->IRQ_EV_n, _CPU_IRQ_SAFE_PRIORITY_);
        NVIC_SetPriority(cfg->IRQ_ER_n, _CPU_IRQ_SAFE_PRIORITY_);

        u16_t CCR;
        if (cfg->freq <= 100000) {
                CCR = max((clocks.PCLK1_Frequency / (2 * cfg->freq)), 0x04);
                i2c->TRISE = (clocks.PCLK1_Frequency / 1000000) + 1;

        } else {
                if (I2C_HW[major].duty_cycle_16_9) {
                        CCR  = (clocks.PCLK1_Frequency / (cfg->freq * 3));
                } else {
                        CCR  = (clocks.PCLK1_Frequency / (cfg->freq * 25));
                        CCR |= PI2C_CCR_DUTY;
                }

                if ((CCR & PI2C_CCR_CCR) == 0) {
                        CCR |= 1;
                }

                CCR |= PI2C_CCR_FS;

                i2c->TRISE = (((clocks.PCLK1_Frequency / 1000000) * 300) / 1000) + 1;
        }

        i2c->CR1 = PI2C_CR1_SWRST;
        i2c->CR1 = 0;
        i2c->CR2 = (clocks.PCLK1_Frequency / 1000000) & PI2C_CR2_FREQ;
        i2c->CCR = CCR;
        i2c->CR1 = PI2C_CR1_PE;

        _I2C[major]->initialized = true;

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Disables selected I2C peripheral
 * @param  major        I2C peripheral number
 */
//==============================================================================
void _I2C_LLD__release(u8_t major)
{
        const I2C_info_t *cfg = &I2C_HW[major];
        I2C_periph_t     *i2c = const_cast(I2C_periph_t*, I2C_HW[major].I2C);

