devdnl/dnx-rtos/src/system/drivers/i2c/stm32fx/i2c_lld.c
        NVIC_DisableIRQ(cfg->IRQ_EV_n);
        NVIC_DisableIRQ(cfg->IRQ_ER_n);

        WRITE_REG(i2c->CR1, 0);
        SET_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        CLEAR_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        CLEAR_BIT(RCC->APB1ENR, cfg->APB1ENR_clk_mask);

        _I2C[major]->initialized = false;
}

//==============================================================================
/**
 * @brief  Function generate START sequence on I2C bus
 * @param  hdl                  device handle
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__start(I2C_dev_t *hdl)
{
        I2C_periph_t *i2c = get_I2C(hdl);

        u8_t tmp = i2c->DR;
             tmp = i2c->DR;
        (void)tmp;

        WRITE_REG(i2c->SR1, 0);

        CLEAR_BIT(i2c->CR1, PI2C_CR1_STOP);
        SET_BIT(i2c->CR1, PI2C_CR1_START | PI2C_CR1_ACK);

        return wait_for_event_poll(hdl, PI2C_SR1_SB, _I2C_TIMEOUT_START);
}

//==============================================================================
/**
 * @brief  Function generate REPEAT START sequence on I2C bus
 * @param  hdl                  device handle
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__repeat_start(I2C_dev_t *hdl)
{
        I2C_periph_t *i2c = get_I2C(hdl);

        clear_address_event(hdl);

        CLEAR_BIT(i2c->CR1, PI2C_CR1_STOP);
        SET_BIT(i2c->CR1, PI2C_CR1_START | PI2C_CR1_ACK);

        return wait_for_event_poll(hdl, PI2C_SR1_SB, _I2C_TIMEOUT_START);
}

//==============================================================================
/**
 * @brief  Function generate STOP sequence on I2C bus
 * @param  hdl                  device handle
 */
//==============================================================================
void _I2C_LLD__stop(I2C_dev_t *hdl)
{
        I2C_periph_t *i2c = get_I2C(hdl);

        SET_BIT(i2c->CR1, PI2C_CR1_STOP);

        int loop = 0;
        while ((i2c->CR1 & PI2C_CR1_STOP) && (++loop < 2000));

        WRITE_REG(i2c->SR1, 0);
}

//==============================================================================
/**
 * @brief  Function send I2C address sequence
 * @param  hdl                  device handle
 * @param  write                true: compose write address
 * @param  count                number of bytes to be written/read (in transfer).
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__send_address(I2C_dev_t *hdl, bool write, size_t count)
{
        I2C_periph_t *i2c = get_I2C(hdl);

        if (hdl->config.addr_10bit) {

                int err = EIO;

                // send header + 2 most significant bits of 10-bit address
                sys_critical_section_begin();
                {
                        u16_t tmp = i2c->SR1;
                        i2c->DR   = _I2C_HEADER_ADDR_10BIT | ((hdl->config.address & 0xFE) >> 7);
                        (void)tmp;
                }
                sys_critical_section_end();

                err = wait_for_event_poll(hdl, PI2C_SR1_ADD10, _I2C_TIMEOUT_BYTE_TRANSFER);
                if (err) goto finish;

                // send rest of 8 bits of 10-bit address
                sys_critical_section_begin();
                {
                        u16_t tmp = i2c->SR1;
                        i2c->DR   = hdl->config.address;
                        (void)tmp;
                }
                sys_critical_section_end();

                err = wait_for_event_poll(hdl, PI2C_SR1_ADDR, _I2C_TIMEOUT_BYTE_TRANSFER);
                if (err) goto finish;

                // send repeat start
                err = _I2C_LLD__repeat_start(hdl);
                if (err) goto finish;

                // send header
                sys_critical_section_begin();
                {
                        if (!write && (count == 2)) {
                                SET_BIT(i2c->CR1, PI2C_CR1_POS | PI2C_CR1_ACK);
                        }

                        u8_t hdr  = _I2C_HEADER_ADDR_10BIT | ((hdl->config.address >> 7) & 0x6);
                        u16_t tmp = i2c->SR1;
                        i2c->DR   = write ? hdr : hdr | 0x01;
                        (void)tmp;
                }
                sys_critical_section_end();

                err = wait_for_event_poll(hdl, PI2C_SR1_ADDR, _I2C_TIMEOUT_BYTE_TRANSFER);

                finish:
                if (err) {
                        printk("I2C%d:%d send 10-bit address error", hdl->major, hdl->minor);
                }

                return err;

        } else {
                sys_critical_section_begin();
                {
                        if (!write && (count == 2)) {
                                SET_BIT(i2c->CR1, PI2C_CR1_POS | PI2C_CR1_ACK);
                        }

                        u16_t tmp = i2c->SR1;
                        i2c->DR   = write ? (hdl->config.address & 0xFE) : (hdl->config.address | 0x01);
                        (void)tmp;
                }
                sys_critical_section_end();

                int err =  wait_for_event_poll(hdl, PI2C_SR1_ADDR, _I2C_TIMEOUT_BYTE_TRANSFER);
                if (err) {
                        printk("I2C%d:%d send 7-bit address error", hdl->major, hdl->minor);
                }

                return err;
        }
}

//==============================================================================
/**
 * @brief  Function receive bytes from I2C bus (master-receiver)
 * @param  hdl                  device handle
 * @param  dst                  destination buffer
 * @param  count                number of bytes to receive
 * @param  rdcnt                number of read bytes
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__receive(I2C_dev_t *hdl, u8_t *dst, size_t count, size_t *rdcnt)
{
        int      err = EIO;
        ssize_t  n   = 0;
        I2C_periph_t   *i2c = get_I2C(hdl);

        if (count >= 3) {
#if USE_DMA > 0
                if (I2C_HW[hdl->major].use_DMA) {
                        u32_t dmad = _DMA_DDI_reserve(0, I2C_HW[hdl->major].DMA_rx_stream_pri);
                        if (dmad == 0) {
                                dmad = _DMA_DDI_reserve(0, I2C_HW[hdl->major].DMA_rx_stream_alt);
                        }

