devdnl/dnx-rtos/src/system/drivers/i2c/stm32fx/i2c_lld.c
        // clear error flags
        i2c->SR1 = 0;

        bool woken = false;
        sys_queue_send_from_ISR(_I2C[major]->event, &err, &woken);

        CLEAR_BIT(i2c->CR2, PI2C_CR2_ITEVTEN | PI2C_CR2_ITERREN | PI2C_CR2_ITBUFEN);
        sys_thread_yield_from_ISR(woken);
}

//==============================================================================
/**
 * @brief  DMA callback.
 * @param  stream       DMA stream
 * @param  SR           DMA transaction status (DMA_SR_*)
 * @param  arg          user's object
 * @return If IRQ should yield then true is returned, false otherwise.
 */
//==============================================================================
#if USE_DMA > 0
#if defined(ARCH_stm32f1)
static bool DMA_callback(DMA_Channel_t *channel, u8_t SR, void *arg)
#elif defined(ARCH_stm32f4)
static bool DMA_callback(DMA_Stream_TypeDef *stream, u8_t SR, void *arg)
#endif
{
        I2C_mem_t    *I2C_mem = arg;
        I2C_periph_t *i2c     = const_cast(I2C_periph_t*, I2C_HW[I2C_mem->major].I2C);

        int err = (SR & DMA_SR_TEIF) ? EIO : ESUCC;

        if (!err) {
                err = (i2c->SR1 & (PI2C_SR1_ARLO | PI2C_SR1_BERR | PI2C_SR1_AF))
                    ? EIO : ESUCC;
        }

        if (!err) {
                err = (SR & DMA_SR_TCIF) ? ESUCC : EIO;
        }

        if (!err) {
                #if defined(ARCH_stm32f1)
                u32_t NDTR = channel->CNDTR;
                #elif defined(ARCH_stm32f4)
                u32_t NDTR = stream->NDTR;
                #endif
                err = (NDTR > 0) ? EIO : ESUCC;
        }

        bool yield = false;
        sys_queue_send_from_ISR(I2C_mem->event, &err, &yield);

        return yield;
}
#endif

//==============================================================================
/**
 * @brief  I2C1 Event IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C1EN)
void I2C1_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C1 Error IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C1EN)
void I2C1_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Event IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C2EN)
void I2C2_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Error IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C2EN)
void I2C2_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief  I2C3 Event IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C3EN)
void I2C3_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C3);
}
#endif

//==============================================================================
/**
 * @brief  I2C3 Error IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C3EN)
void I2C3_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C3);
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
